local _, ns = ...

ns.MapPins = {
    ["maraudon"] = {
        quest = { { 23.7, 78, 7066, 2 } },
        entrance = { { 76.7, 65.6, nil, 1 }, { 62.3, 28.1, nil, 1 } },
        next = { { 14, 58.6, 1 } },
    },
    ["scholomance"] = {
        entrance = { { 38.8, 65.4, nil, 1 }, { 62.3, 29.3, nil, 2 }, { 59.5, 62.5, nil, 3 }, { 67.1, 30.5, nil, 4 } },
    },
    ["dire_maul_west"] = {
        entrance = { { 93.5, 72.1, nil, 2 } },
    },
    ["dire_maul_east"] = {
        entrance = { { 28, 55.2, nil, 6 } },
    },
    ["blackrock_depths"] = {
        quest = { { 52.1, 81.5, 4341, 1 } },
    },
    ["sunken_temple"] = {
        entrance = { { 49.7, 10.9, nil, 1 } },
    },
    ["zul_farrak"] = {
        quest = { { 28.9, 44.6, 2770, 1 } },
        entrance = { { 56.5, 90.1, nil, 1 } },
    },
    ["uldaman"] = {
        quest = { { 60.2, 51.5, 704, 3, "附近拾取雕文石罐" }, { 54.4, 64.7, 709, 3 }, { 48.3, 28.7, 721, 3 }, { 54.5, 70, 722, 3, "任务怪马格雷甘·深影" }, { 38.6, 85.7, 1360, 3, "地面上宝箱拾取克鲁姆·粗臂的宝藏" }, { 38.6, 5.5, 2278, 1, "打完尾王进入密室" }, { 54.2, 63.2, 2318, 1 }, { 33, 61.1, 2342, 3, "地面上宝箱拾取加勒特的家族宝藏" }, { 38.9, 14.4, 2361, 1 } },
        entrance = { { 68.1, 72.3, nil, 1 }, { 63.1, 62.1, nil, 2 }, { 36.8, 28.3, nil, 3 } },
        prev = { { 76, 37, 3, "洞穴入口" } },
        next = { { 46.5, 22, 1 } },
    },
    ["razorfen_downs"] = {
        quest = { { 43.7, 56, 3341, 1 }, { 80.2, 21.7, 3523, 1 }, { 82.2, 19.6, 3525, 1 } },
    },
    ["sm_cathedral"] = {
        entrance = { { 62.3, 92, nil, 1 } },
    },
    ["sm_armory"] = {
        entrance = { { 61.1, 95.6, nil, 1 } },
    },
    ["sm_library"] = {
        quest = { { 83.4, 13.5, 1049, 1 }, { 45.5, 29.6, 1160, 1 } },
        entrance = { { 13, 24.5, nil, 1 } },
    },
    ["sm_graveyard"] = {
        quest = { { 73.6, 57.2, 1051, 1 } },
        entrance = { { 84.4, 82.7, nil, 1 } },
    },
    ["razorfen_kraul"] = {
        quest = { { 25.8, 27.4, 1102, 1 }, { 37, 31.9, 1144, 1 } },
        entrance = { { 71.6, 83.8, nil, 1 } },
    },
    ["gnomeregan"] = {
        quest = { { 82, 79.1, 2904, 2, "护送任务" }, { 37.4, 67.6, 2951, 1 } },
        entrance = { { 64.4, 27.4, nil, 1 } },
        next = { { 47.5, 83.6, 1 } },
    },
    ["the_stockade"] = {
        quest = { { 12.2, 15.2, 377, 1 }, { 69.7, 24.2, 378, 1 }, { 42, 40.8, 386, 1, "塔格尔在副本内。塔格尔通常刷在中央区右手第一间或左手第二间牢房，偶尔刷在左右两翼之间最北端的牢房。" }, { 88.2, 48, 391, 1 } },
        entrance = { { 50.1, 81.3, nil, 1 } },
    },
    ["blackfathom_deeps"] = {
        quest = { { 20.8, 73.8, 1200, 1 }, { 20.9, 73.7, 6561, 1 } },
        entrance = { { 45.7, 11.5, nil, 1 } },
        icon = { { 33.3, 39.8, 1, "洛迦里斯手稿", "A" } },
        next = { { 61.9, 74.7, 1 } },
    },
    ["onyxias_lair"] = {
        entrance = { { 33.9, 20.7 } },
    },
    ["city_of_dalaran"] = {
        entrance = { { 14.4, 79.2, nil, 2 } },
        prev = { { 56.3, 63.4, 1 } },
        next = { { 65.6, 46.5, 2 } },
    },
    ["excavation_wetlands"] = {
        quest = { { 25.4, 51.3, 95646, 1 }, { 44.1, 80.5, 95647, 1 }, { 24.4, 61, 95772, 1 } },
        entrance = { { 83.7, 40.1, nil, 1 } },
    },
    ["hall_of_thanes"] = {
        quest = { { 41.5, 65, 96395, 1 }, { 55, 22, 98423, 1 } },
        entrance = { { 50.5, 94.9, nil, 1 } },
    },
    ["ragefire_chasm"] = {
        quest = { { 63.8, 51.7, 5724, 1 } },
        entrance = { { 61, 8.6, nil, 1 } },
    },
    ["ruins_of_lordaeron"] = {
        entrance = { { 61.2, 21.5, nil, 1 } },
    },
    ["shadowfang_keep"] = {
        entrance = { { 70.4, 60.9, nil, 1 }, { 62, 12.6, nil, 2 } },
        prev = { { 52.6, 89, 3 }, { 52.3, 87.7, 4 }, { 49, 77.6, 5 }, { 41.5, 84.4, 6 }, { 23.8, 76, 7 } },
        next = { { 15.1, 85.9, 1, "饭厅" }, { 35.9, 66.9, 1 }, { 36.1, 39.8, 1, "饭厅" }, { 27.1, 88.6, 2 }, { 53.5, 60.5, 3 }, { 42.3, 73.1, 5 }, { 43.4, 33, 7 } },
    },
    ["the_deadmines"] = {
        entrance = { { 30.8, 15.7, nil, 1 }, { 12.5, 70.1, nil, 2 } },
        next = { { 65.4, 68.8, 1 }, { 84.3, 43, 2 } },
    },
    ["wailing_caverns"] = {
        entrance = { { 47.1, 60.3, nil, 1 } },
    },
}
