local _, ns = ...

if (type(GetLocale) == "function") and GetLocale() ~= "zhCN" then return end

ns.NameOverrides = {
    spell = {
        [1279399] = "军马",
        [1296534] = "被遗忘者战马",
        [5784] = "地狱战马",
        [13819] = "军马",
        [23161] = "恐惧战马",
        [23214] = "战马",
        [1303215] = "运货的科多兽",
        [15780] = "绿色机械陆行鸟",
        [436329] = "金色猎豹",
        [25863] = "黑色其拉作战坦克",
        [26655] = "黑色其拉作战坦克",
        [1292482] = "迅捷海加尔雄鹿",
        [1309268] = "黑色典狱官刃豹坐骑",
        [1309270] = "棕色典狱官刃豹坐骑",
        [1309271] = "灰色典狱官刃豹坐骑",
        [1309272] = "白色典狱官刃豹坐骑",
        [1309346] = "黑色魔暴龙坐骑",
        [1309347] = "蓝色魔暴龙坐骑",
        [1309348] = "绿色魔暴龙坐骑",
        [1309349] = "紫色魔暴龙坐骑",
        [1309350] = "白色魔暴龙坐骑",
        [1309377] = "黑色德鲁伊驼鹿坐骑",
        [1309379] = "白色德鲁伊驼鹿坐骑",
        [1309380] = "绿色德鲁伊驼鹿坐骑",
        [1309381] = "灰色德鲁伊驼鹿坐骑",
    },
    item = {
        [286756] = "鬼灵狼群",
        [286727] = "绯红雄鸡",
        [286724] = "翠绿海龟",
        [98550] = "繁花古树",
        [275818] = "夭夭",
        [229368] = "古鳍尔",
    },
}
